## Read CSV

In [46]:
import os
import pandas as pd

current_directory = os.getcwd()

In [47]:

csv_file_path = os.path.join(current_directory, 'data.csv')
df_csv = pd.read_csv(csv_file_path)
print(type(df_csv))
df_csv

<class 'pandas.core.frame.DataFrame'>

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston
4      Eva   45      Phoenix

## Iterate element

In [59]:
for index, row in df_csv.iterrows():
    print(f"{index}: {row['Name']} {row['Age']}")

0: Alice 25
1: Bob 30
2: Charlie 35
3: David 40
4: Eva 45

## Filter

In [48]:
# Filter with multiple condition
display(df_csv.loc[(df_csv['Name'] == "Alice") | (df_csv['Age'] == 40)])

    Name  Age      City
0  Alice   25  New York
3  David   40   Houston

In [49]:
# Two filters are identical
display(df_csv.loc[df_csv["Age"] == 45]['City'].squeeze())
display(df_csv.loc[df_csv["Age"] == 45, "City"])

'Phoenix'

4    Phoenix
Name: City, dtype: object

In [50]:
# Get specific colume
display(df_csv.loc[(df_csv['Name'] == "Alice")][['City', 'Age']])

       City  Age
0  New York   25

## Pandas create DataFrame

In [51]:

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 24, 34],
    'City': ['New York', 'LA', 'Chicago', 'Houston']
}
df = pd.DataFrame(data)
df

      Name  Age      City
0    Alice   25  New York
1      Bob   30        LA
2  Charlie   24   Chicago
3    David   34   Houston

# to_dict method

In [52]:
df = pd.DataFrame(data)
display(df)

# convert dataframe to dict of list
df = df.to_dict(orient="records")
display(df)

      Name  Age      City
0    Alice   25  New York
1      Bob   30        LA
2  Charlie   24   Chicago
3    David   34   Houston

[{'Name': 'Alice', 'Age': 25, 'City': 'New York'},
 {'Name': 'Bob', 'Age': 30, 'City': 'LA'},
 {'Name': 'Charlie', 'Age': 24, 'City': 'Chicago'},
 {'Name': 'David', 'Age': 34, 'City': 'Houston'}]

### Pandas series

In [53]:
# A Pandas Series is one-dimetional array that can hold any data type.

import pandas as pd

data = [10, 20, 30, 40, 50]
series = pd.Series(data)

display(series)

0    10
1    20
2    30
3    40
4    50
dtype: int64

## Pandas read json

In [54]:
import os
import pandas as pd

current_directory = os.getcwd()
json_file_path = os.path.join(current_directory, 'data.json')

df_json = pd.read_json(json_file_path)
display(df_json)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston
4      Eva   45      Phoenix